arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
    /* Check if driver is busy */
    if (!master->i2cIdle)
    {
        return LPI2C_STATUS_BUSY;
    }

    /* Copy parameters to driver state structure */
    master->txBuff = txBuff;
    master->txSize = txSize;
    master->isBlocking = blocking;
    master->sendStop = sendStop;
    master->i2cIdle = false;
    master->status = LPI2C_STATUS_BUSY;

    /* Initiate communication */
    LPI2C_DRV_MasterSendAddress(baseAddr, master, false);

    /* Queue data bytes to fill tx fifo */
    LPI2C_DRV_MasterQueueData(baseAddr, master);

    /* Set tx FIFO watermark */
    LPI2C_HAL_MasterSetTxFIFOWatermark(baseAddr, 0U);

    /* Enable relevant events */
    if (master->operatingMode == LPI2C_ULTRAFAST_MODE)
    {
        /* Do not enable NACK event reporting in ultra-fast mode */
        LPI2C_HAL_MasterSetInt(baseAddr, LPI2C_HAL_MASTER_FIFO_ERROR_INT |
                                         LPI2C_HAL_MASTER_ARBITRATION_LOST_INT |
                                         LPI2C_HAL_MASTER_TRANSMIT_DATA_INT,
                               true);
    }
    else
    {
        LPI2C_HAL_MasterSetInt(baseAddr, LPI2C_HAL_MASTER_FIFO_ERROR_INT |
                                         LPI2C_HAL_MASTER_ARBITRATION_LOST_INT |
                                         LPI2C_HAL_MASTER_NACK_DETECT_INT |
                                         LPI2C_HAL_MASTER_TRANSMIT_DATA_INT,
                               true);
    }

    if (blocking)
    {
        while (master->i2cIdle == false);
        return master->status;
    }
    else
    {
        return LPI2C_STATUS_SUCCESS;
    }

}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterReceive
 * Description   : perform a receive transaction on the I2C bus
 *
 *END**************************************************************************/
static lpi2c_status_t LPI2C_DRV_MasterReceive(uint32_t instance,
                                              uint8_t * rxBuff,
                                              uint32_t rxSize,
                                              bool sendStop,
                                              bool blocking)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;
    uint8_t rxBytes;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0U);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    /* Check if driver is busy */
    if (!master->i2cIdle)
    {
        return LPI2C_STATUS_BUSY;
    }
    if (master->operatingMode == LPI2C_ULTRAFAST_MODE)
    {
        /* No reception possible in ultra-fast mode */
        return LPI2C_STATUS_FAIL;
    }

    /* Copy parameters to driver state structure */
    master->rxBuff = rxBuff;
    master->rxSize = rxSize;
    master->isBlocking = blocking;
    master->sendStop = sendStop;
    master->i2cIdle = false;
    master->status = LPI2C_STATUS_BUSY;

    /* Initiate communication */
    LPI2C_DRV_MasterSendAddress(baseAddr, master, true);

    /* Queue receive command for rxSize bytes */
    LPI2C_DRV_MasterQueueCmd(baseAddr, master, LPI2C_MASTER_COMMAND_RECEIVE, rxSize - 1U);

    /* Set rx FIFO watermark */
    rxBytes = LPI2C_HAL_GetMasterRxFIFOSize(baseAddr);
    if (rxBytes > rxSize)
    {
        rxBytes = rxSize;
    }
    LPI2C_HAL_MasterSetRxFIFOWatermark(baseAddr, rxBytes - 1U);

    /* Enable relevant events */
    if (!LPI2C_DRV_MasterCmdQueueEmpty(master))
    {
        /* Enable tx event too if there are commands in the software FIFO */
        LPI2C_HAL_MasterSetInt(baseAddr, LPI2C_HAL_MASTER_FIFO_ERROR_INT |
                                         LPI2C_HAL_MASTER_ARBITRATION_LOST_INT |
                                         LPI2C_HAL_MASTER_NACK_DETECT_INT |
                                         LPI2C_HAL_MASTER_TRANSMIT_DATA_INT |
                                         LPI2C_HAL_MASTER_RECEIVE_DATA_INT,
                               true);
    }
    else
    {
        LPI2C_HAL_MasterSetInt(baseAddr, LPI2C_HAL_MASTER_FIFO_ERROR_INT |
                                         LPI2C_HAL_MASTER_ARBITRATION_LOST_INT |
                                         LPI2C_HAL_MASTER_NACK_DETECT_INT |
                                         LPI2C_HAL_MASTER_RECEIVE_DATA_INT,
                               true);
    }

    if (blocking)
    {
        while (master->i2cIdle == false);
        return master->status;
    }
    else
    {
        return LPI2C_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterSetOperatingMode
 * Description   : sets the operating mode of the I2C master
 *
 *END**************************************************************************/
static void LPI2C_DRV_MasterSetOperatingMode(uint32_t instance, lpi2c_mode_t operatingMode)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    if (operatingMode == LPI2C_ULTRAFAST_MODE)
    {
        LPI2C_HAL_MasterSetPinConfig(baseAddr, LPI2C_CFG_2PIN_OUTPUT_ONLY);
        LPI2C_HAL_MasterSetNACKConfig(baseAddr, LPI2C_NACK_IGNORE);
    }
    else
    {
        LPI2C_HAL_MasterSetPinConfig(baseAddr, LPI2C_CFG_2PIN_OPEN_DRAIN);
        LPI2C_HAL_MasterSetNACKConfig(baseAddr, LPI2C_NACK_RECEIVE);
    }
    master->operatingMode = operatingMode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveSetOperatingMode
 * Description   : sets the operating mode of the I2C slave
 *
 *END**************************************************************************/
static void LPI2C_DRV_SlaveSetOperatingMode(uint32_t instance, lpi2c_mode_t operatingMode)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    if (operatingMode == LPI2C_ULTRAFAST_MODE)
    {
        LPI2C_HAL_SlaveSetIgnoreNACK(baseAddr, LPI2C_SLAVE_NACK_CONTINUE_TRANSFER);
        LPI2C_HAL_SlaveSetTransmitNACK(baseAddr, LPI2C_SLAVE_TRANSMIT_NACK);
        /* Disable all clock stretching in ultra-fast mode */
        LPI2C_HAL_SlaveSetACKStall(baseAddr, false);
        LPI2C_HAL_SlaveSetTXDStall(baseAddr, false);
        LPI2C_HAL_SlaveSetRXStall(baseAddr, false);
        LPI2C_HAL_SlaveSetAddrStall(baseAddr, false);
    }
    else
    {
        LPI2C_HAL_SlaveSetIgnoreNACK(baseAddr, LPI2C_SLAVE_NACK_END_TRANSFER);
        LPI2C_HAL_SlaveSetTransmitNACK(baseAddr, LPI2C_SLAVE_TRANSMIT_ACK);
        /* Enable clock stretching except ACKSTALL (we don't need to send ACK/NACK manually) */
        LPI2C_HAL_SlaveSetACKStall(baseAddr, false);
        LPI2C_HAL_SlaveSetTXDStall(baseAddr, true);
        LPI2C_HAL_SlaveSetRXStall(baseAddr, true);
        LPI2C_HAL_SlaveSetAddrStall(baseAddr, true);
    }
    if (operatingMode == LPI2C_HIGHSPEED_MODE)
    {
        /* Enable detection of the High-speed Mode master code */
        LPI2C_HAL_SlaveSetHighSpeedModeDetect(baseAddr, true);
    }
    else
    {
        /* Disable detection of the High-speed Mode master code */
        LPI2C_HAL_SlaveSetHighSpeedModeDetect(baseAddr, false);
    }

    slave->operatingMode = operatingMode;
}

/*! @endcond */

