arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterInit
 * Description   : initialize the I2C master mode driver
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterInit(uint32_t instance,
                                    const lpi2c_master_user_config_t * userConfigPtr,
                                    lpi2c_master_state_t * master)
{
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    if (g_lpi2cStatePtr[instance])
    {
        return LPI2C_STATUS_FAIL;
    }

    baseAddr = g_lpi2cBase[instance];
    g_lpi2cStatePtr[instance] = master;

    /* Initialize driver status structure */
    master->rxBuff = NULL;
    master->rxSize = 0U;
    master->txBuff = NULL;
    master->txSize = 0U;
    master->status = LPI2C_STATUS_SUCCESS;
    master->i2cIdle = true;
    master->masterCode = userConfigPtr->masterCode;
    master->slaveAddress = userConfigPtr->slaveAddress;
    master->is10bitAddr = userConfigPtr->is10bitAddr;
    master->highSpeedInProgress = false;
    LPI2C_DRV_MasterResetQueue(master);

    /* Enable lpi2c interrupt */
    INT_SYS_EnableIRQ(g_lpi2cIrqId[instance]);

    /* Initialize module */
    LPI2C_HAL_Init(baseAddr);

    /* Set baud rate */
    LPI2C_DRV_MasterSetBaudRate(instance, userConfigPtr->operatingMode, userConfigPtr->baudRate, userConfigPtr->baudRateHS);

    /* Set slave address */
    LPI2C_DRV_MasterSetSlaveAddr(instance, userConfigPtr->slaveAddress, userConfigPtr->is10bitAddr);

    /* Enable LPI2C master */
    LPI2C_HAL_MasterSetEnable(baseAddr, true);

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterDeinit
 * Description   : deinitialize the I2C master mode driver
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterDeinit(uint32_t instance)
{
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];

    g_lpi2cStatePtr[instance] = NULL;

    /* Disable master */
    LPI2C_HAL_MasterSetEnable(baseAddr, false);

    /* Disable i2c interrupt */
    INT_SYS_DisableIRQ(g_lpi2cIrqId[instance]);

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterGetBaudRate
 * Description   : returns the currently configured baud rate
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterGetBaudRate(uint32_t instance, uint32_t *baudRate, uint32_t *baudRateHS)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;
    clock_manager_error_code_t clkErr;
    uint32_t prescaler;
    uint32_t clkLo;
    uint32_t clkHi;
    uint32_t inputClock;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_lpi2cClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return LPI2C_STATUS_FAIL;
    }
    /* Ignoring the glitch filter, the baud rate formula is:
            SCL_freq = Input_freq / (2^PRESCALER * (CLKLO + CLKHI + 2))
    */
    prescaler = LPI2C_HAL_MasterGetPrescaler(baseAddr);
    clkHi = LPI2C_HAL_MasterGetClockHighPeriod(baseAddr);
    clkLo = LPI2C_HAL_MasterGetClockLowPeriod(baseAddr);

    *baudRate = inputClock / ((1U << prescaler) * (clkLo + clkHi + 2U));

    if (master->operatingMode == LPI2C_HIGHSPEED_MODE)
    {
        clkHi = LPI2C_HAL_MasterGetClockHighPeriodHS(baseAddr);
        clkLo = LPI2C_HAL_MasterGetClockLowPeriodHS(baseAddr);

        *baudRateHS = inputClock / ((1U << prescaler) * (clkLo + clkHi + 2U));
    }

    return LPI2C_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterSetBaudRate
 * Description   : set the baud rate for any subsequent I2C communication
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterSetBaudRate(uint32_t instance,
                                           const lpi2c_mode_t operatingMode,
                                           const uint32_t baudRate,
                                           const uint32_t baudRateHS)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;
    bool masterEnabled;
    clock_manager_error_code_t clkErr;
    uint32_t inputClock;
    uint32_t minPrescaler;
    uint32_t prescaler;
    uint32_t clkTotal;
    uint32_t clkLo;
    uint32_t clkHi;
    uint32_t setHold;
    uint32_t dataVd;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    /* Check if driver is busy */
    if (!master->i2cIdle)
    {
        return LPI2C_STATUS_BUSY;
    }

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_lpi2cClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return LPI2C_STATUS_FAIL;
    }

    masterEnabled = LPI2C_HAL_MasterGetEnable(baseAddr);
    if (masterEnabled)
    {
        /* Disable master */
        LPI2C_HAL_MasterSetEnable(baseAddr, false);
    }
    /* Ignoring the glitch filter, the baud rate formula is:
            SCL_freq = Input_freq / (2^PRESCALER * (CLKLO + CLKHI + 2))
            Assume CLKLO = 2*CLKHI, SETHOLD = CLKHI, DATAVD = CLKHI/2
    */
    /* Compute minimum prescaler for which CLKLO and CLKHI values are in valid range. Always round up. */
    minPrescaler = (inputClock - 1U) / (baudRate * (CLKHI_MAX_VALUE + CLKLO_MAX_VALUE + 2U)) + 1U;
    for (prescaler = 0U; prescaler < 7U; prescaler++)
    {
        if ((1U << prescaler) >= minPrescaler) break;
    }
    /* Compute CLKLO and CLKHI values for this prescaler. Round to nearest integer. */
    clkTotal = (inputClock + ((baudRate << prescaler) >> 1U)) / (baudRate << prescaler);
    if (clkTotal > (CLKHI_MAX_VALUE + CLKLO_MAX_VALUE + 2U))
    {
        clkTotal = (CLKHI_MAX_VALUE + CLKLO_MAX_VALUE + 2U);
    }
    clkHi = (clkTotal - 2U) / 3U;
    clkLo = clkTotal - 2U - clkHi;
    if (clkHi < CLKHI_MIN_VALUE)
    {
        clkHi = CLKHI_MIN_VALUE;
    }
    if (clkLo < CLKLO_MIN_VALUE)
    {
        clkLo = CLKLO_MIN_VALUE;
    }
    /* Compute DATAVD and SETHOLD */
    setHold = clkHi;
    dataVd = clkHi >> 1U;
    if (setHold < SETHOLD_MIN_VALUE)
    {
        setHold = SETHOLD_MIN_VALUE;
    }
    if (dataVd < DATAVD_MIN_VALUE)
    {
        dataVd = DATAVD_MIN_VALUE;
    }

    /* Apply settings */
    LPI2C_HAL_MasterSetPrescaler(baseAddr, (lpi2c_master_prescaler_t)prescaler);
    LPI2C_HAL_MasterSetDataValidDelay(baseAddr, dataVd);
    LPI2C_HAL_MasterSetSetupHoldDelay(baseAddr, setHold);
    LPI2C_HAL_MasterSetClockHighPeriod(baseAddr, clkHi);
    LPI2C_HAL_MasterSetClockLowPeriod(baseAddr, clkLo);

    if (operatingMode == LPI2C_HIGHSPEED_MODE)
    {
        /* Compute settings for High-speed baud rate */
        /* Compute High-speed CLKLO and CLKHI values for the same prescaler. Round to nearest integer. */
        clkTotal = (inputClock + ((baudRateHS << prescaler) >> 1U)) / (baudRateHS << prescaler);
        if (clkTotal > (CLKHI_MAX_VALUE + CLKLO_MAX_VALUE + 2U))
        {
            clkTotal = (CLKHI_MAX_VALUE + CLKLO_MAX_VALUE + 2U);
        }
        clkHi = (clkTotal - 2U) / 3U;
        clkLo = clkTotal - 2U - clkHi;
        if (clkHi < CLKHI_MIN_VALUE)
        {
            clkHi = CLKHI_MIN_VALUE;
        }
        if (clkLo < CLKLO_MIN_VALUE)
        {
            clkLo = CLKLO_MIN_VALUE;
        }
        /* Compute High-speed DATAVD and SETHOLD */
        setHold = clkHi;
        dataVd = clkHi >> 1U;
        if (setHold < SETHOLD_MIN_VALUE)
        {
            setHold = SETHOLD_MIN_VALUE;
        }
        if (dataVd < DATAVD_MIN_VALUE)
        {
            dataVd = DATAVD_MIN_VALUE;
        }

