arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
        /* Apply High-speed settings */
        LPI2C_HAL_MasterSetDataValidDelayHS(baseAddr, dataVd);
        LPI2C_HAL_MasterSetSetupHoldDelayHS(baseAddr, setHold);
        LPI2C_HAL_MasterSetClockHighPeriodHS(baseAddr, clkHi);
        LPI2C_HAL_MasterSetClockLowPeriodHS(baseAddr, clkLo);
    }
    if (master->operatingMode != operatingMode)
    {
         /* Perform other settings related to the chosen operating mode */
        LPI2C_DRV_MasterSetOperatingMode(instance, operatingMode);
    }

    if (masterEnabled)
    {
        /* Re-enable master */
        LPI2C_HAL_MasterSetEnable(baseAddr, true);
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterSetSlaveAddr
 * Description   : set the slave address for any subsequent I2C communication
 *
 *END**************************************************************************/
void LPI2C_DRV_MasterSetSlaveAddr(uint32_t instance, const uint16_t address, const bool is10bitAddr)
{
    lpi2c_master_state_t * master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    master->slaveAddress = address;
    master->is10bitAddr = is10bitAddr;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterSendDataBlocking
 * Description   : perform a blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterSendDataBlocking(uint32_t instance,
                                            const uint8_t * txBuff,
                                            uint32_t txSize,
                                            bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    return LPI2C_DRV_MasterSend(instance, txBuff, txSize, sendStop, true);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterSendData
 * Description   : perform a non-blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterSendData(uint32_t instance,
                                    const uint8_t * txBuff,
                                    uint32_t txSize,
                                    bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    return LPI2C_DRV_MasterSend(instance, txBuff, txSize, sendStop, false);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterGetSendStatus
 * Description   : return the current status of the I2C master transmit
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterGetSendStatus(uint32_t instance, uint32_t *bytesRemaining)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    if (bytesRemaining)
    {
        /* Remaining bytes = bytes in buffer + bytes in tx FIFO */
        *bytesRemaining = master->txSize + LPI2C_HAL_MasterGetTxFIFOCount(baseAddr);
    }

    return master->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterAbortTransferData
 * Description   : abort a non-blocking I2C Master transmission or reception
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterAbortTransferData(uint32_t instance)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    if (master->i2cIdle == true)
    {
        /* No transfer in progress */
        return LPI2C_STATUS_NO_TRANSFER;
    }
    if (master->rxBuff != NULL)
    {
        /* Aborting a reception not supported because hardware will continue the 
           current command even if the FIFO is reset and this could last indefinitely */
        return LPI2C_STATUS_FAIL;
    }
    /* End transfer: force stop generation, reset FIFOs */
    LPI2C_DRV_MasterEndTransfer(baseAddr, master, true, true);
    master->status = LPI2C_STATUS_ABORTED;
    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterReceiveDataBlocking
 * Description   : perform a blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterReceiveDataBlocking(uint32_t instance,
                                               uint8_t * rxBuff,
                                               uint32_t rxSize,
                                               bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    return LPI2C_DRV_MasterReceive(instance, rxBuff, rxSize, sendStop, true);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterReceiveData
 * Description   : perform a non-blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterReceiveData(uint32_t  instance,
                                       uint8_t * rxBuff,
                                       uint32_t rxSize,
                                       bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    return LPI2C_DRV_MasterReceive(instance, rxBuff, rxSize, sendStop, false);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterGetReceiveStatus
 * Description   : return the current status of the I2C master receive
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_MasterGetReceiveStatus(uint32_t instance,
                                            uint32_t *bytesRemaining)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

