arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
    if (bytesRemaining)
    {
        /* Remaining bytes = free space in buffer - bytes in rx FIFO */
        *bytesRemaining = master->rxSize - LPI2C_HAL_MasterGetRxFIFOCount(baseAddr);
    }

    return master->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_MasterIRQHandler
 * Description   : handle non-blocking master operation when I2C interrupt occurs
 *
 *END**************************************************************************/
void LPI2C_DRV_MasterIRQHandler(uint32_t instance)
{
    LPI2C_Type *baseAddr;
    lpi2c_master_state_t * master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    master = (lpi2c_master_state_t *)g_lpi2cStatePtr[instance];

    /* Check which event caused the interrupt */
    if (LPI2C_HAL_MasterGetTransmitDataRequestEvent(baseAddr))
    {
        /* More data needed for transmission */
        if (!LPI2C_DRV_MasterCmdQueueEmpty(master))
        {
            /* If there are queued commands, send them */
            LPI2C_DRV_MasterSendQueuedCmd(baseAddr, master);
        }
        else if (master->txBuff != NULL)
        {
            /* A transmission is in progress */
            if (master->txSize == 0U)
            {
                /* There is no more data in buffer, the transmission is over */
                LPI2C_DRV_MasterEndTransfer(baseAddr, master, master->sendStop, false);
                master->status = LPI2C_STATUS_SUCCESS;
            }
            else
            {
                /* Queue data bytes to fill tx fifo */
                LPI2C_DRV_MasterQueueData(baseAddr, master);
            }
        }
        else
        {
            /* No more commands and no transmission in progress - disable tx event */
            LPI2C_HAL_MasterSetInt(baseAddr, LPI2C_HAL_MASTER_TRANSMIT_DATA_INT, false);
        }
    }
    if (LPI2C_HAL_MasterGetReceiveDataReadyEvent(baseAddr))
    {
        /* Received data ready */
#ifdef DEV_ERROR_DETECT
        DEV_ASSERT(master->rxBuff != NULL);
#endif
        /* Transfer received data to user buffer */
        while ((LPI2C_HAL_MasterGetRxFIFOCount(baseAddr) > 0U) && (master->rxSize > 0U))
        {
            master->rxBuff[0U] = LPI2C_HAL_MasterGetRxData(baseAddr);
            master->rxBuff++;
            master->rxSize--;
        }
        if (master->rxSize == 0U)
        {
            /* Done receiving */
            LPI2C_DRV_MasterEndTransfer(baseAddr, master, master->sendStop, false);
            master->status = LPI2C_STATUS_SUCCESS;
        }
        else if (master->rxSize <= LPI2C_HAL_MasterGetRxFIFOWatermark(baseAddr))
        {
            /* Reduce rx watermark to receive the last few bytes */
            LPI2C_HAL_MasterSetRxFIFOWatermark(baseAddr, master->rxSize - 1U);
        }
        else
        {
            /* Continue reception */
        }
    }
    if (LPI2C_HAL_MasterGetFIFOErrorEvent(baseAddr))
    {
        /* FIFO error */
        LPI2C_HAL_MasterClearFIFOErrorEvent(baseAddr);
        /* End transfer: no stop generation (the module will handle that by itself 
           if needed), reset FIFOs */
        LPI2C_DRV_MasterEndTransfer(baseAddr, master, false, true);
        master->highSpeedInProgress = false; /* High-speed transfers end at STOP condition */
        master->status = LPI2C_STATUS_FAIL;
    }
    if (LPI2C_HAL_MasterGetArbitrationLostEvent(baseAddr))
    {
        /* Arbitration lost */
        LPI2C_HAL_MasterClearArbitrationLostEvent(baseAddr);
        /* End transfer: no stop generation (the module will handle that by itself 
           if needed), reset FIFOs */
        LPI2C_DRV_MasterEndTransfer(baseAddr, master, false, true);
        master->status = LPI2C_STATUS_ARIBTRATION_LOST;
    }
    if (LPI2C_HAL_MasterGetNACKDetectEvent(baseAddr))
    {
        /* Received NACK */
        LPI2C_HAL_MasterClearNACKDetectEvent(baseAddr);
        /* Ignore NACK in Ultra Fast mode */
        if (master->operatingMode != LPI2C_ULTRAFAST_MODE)
        {
            /* End transfer: no stop generation (the module will handle that by itself 
               if needed), reset FIFOs */
            LPI2C_DRV_MasterEndTransfer(baseAddr, master, false, true);
            master->highSpeedInProgress = false; /* High-speed transfers end at STOP condition */
            master->status = LPI2C_STATUS_RECEIVED_NACK;
        }
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveInit
 * Description   : initialize the I2C slave mode driver
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveInit(uint32_t instance,
                                   const lpi2c_slave_user_config_t * userConfigPtr,
                                   lpi2c_slave_state_t * slave)
{
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(userConfigPtr != NULL);
    DEV_ASSERT(slave != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    if (g_lpi2cStatePtr[instance])
    {
        return LPI2C_STATUS_FAIL;
    }

    baseAddr = g_lpi2cBase[instance];
    g_lpi2cStatePtr[instance] = slave;

    /* Initialize driver status structure */
    slave->status = LPI2C_STATUS_SUCCESS;
    slave->slaveListening = userConfigPtr->slaveListening;
    slave->slaveCallback = userConfigPtr->slaveCallback;
    slave->callbackParam = userConfigPtr->callbackParam;
    slave->txBuff = NULL;
    slave->rxBuff = NULL;
    slave->txSize = 0U;
    slave->rxSize = 0U;
    slave->txBusy = false;
    slave->rxBusy = false;

    /* Enable lpi2c interrupt */
    INT_SYS_EnableIRQ(g_lpi2cIrqId[instance]);

    /* Initialize module */
    LPI2C_HAL_Init(baseAddr);

    /* Configure slave address */
    LPI2C_HAL_SlaveSetAddr0(baseAddr, userConfigPtr->slaveAddress);
    if (userConfigPtr->is10bitAddr)
    {
        LPI2C_HAL_SlaveSetAddrConfig(baseAddr, LPI2C_SLAVE_ADDR_MATCH_0_10BIT);
    }
    else
    {
        LPI2C_HAL_SlaveSetAddrConfig(baseAddr, LPI2C_SLAVE_ADDR_MATCH_0_7BIT);
    }

