arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
    /* Configure operating mode */
    LPI2C_DRV_SlaveSetOperatingMode(instance, userConfigPtr->operatingMode);

    if (userConfigPtr->slaveListening)
    {
        /* Activate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_RECEIVE_DATA_INT |
                                        LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT,
                              true);
        /* Enable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, true);
    }


    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveDeinit
 * Description   : de-initialize the I2C slave mode driver
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveDeinit(uint32_t instance)
{
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];

    g_lpi2cStatePtr[instance] = NULL;

    /* Disable LPI2C slave */
    LPI2C_HAL_SlaveSetEnable(baseAddr, false);

    /* Disable i2c interrupt */
    INT_SYS_DisableIRQ(g_lpi2cIrqId[instance]);

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveGetHandler
 * Description   : return the I2C slave run-time state structure
 *
 *END**************************************************************************/
lpi2c_slave_state_t * LPI2C_DRV_SlaveGetHandler(uint32_t instance)
{
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    return slave;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveSetTxBuffer
 * Description   : Provide a buffer for transmitting data.
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveSetTxBuffer(uint32_t instance,
                                                 const uint8_t * txBuff,
                                                 uint32_t txSize)
{
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    slave->txBuff = txBuff;
    slave->txSize = txSize;

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveSetRxBuffer
 * Description   : Provide a buffer for receiving data.
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveSetRxBuffer(uint32_t instance,
                                                 uint8_t * rxBuff,
                                                 uint32_t  rxSize)
{
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    slave->rxBuff = rxBuff;
    slave->rxSize = rxSize;

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveSendData
 * Description   : perform a non-blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveSendData(uint32_t instance,
                                   const uint8_t * txBuff,
                                   uint32_t txSize)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    if (!slave->slaveListening)
    {
        if (slave->txBusy == true)
        {
            /* Slave is busy */
            return LPI2C_STATUS_BUSY;
        }
        slave->txBuff = txBuff;
        slave->txSize = txSize;
        slave->status = LPI2C_STATUS_BUSY;
        /* Activate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT,
                              true);
        slave->txBusy = true;
        /* Enable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, true);
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveSendDataBlocking
 * Description   : perform a blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveSendDataBlocking(uint32_t    instance,
                                           const uint8_t *  txBuff,
                                           uint32_t   txSize)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];
    if (!slave->slaveListening)
    {
        if (slave->txBusy == true)
        {
            /* Slave is busy */
            return LPI2C_STATUS_BUSY;
        }
        slave->txBuff = txBuff;
        slave->txSize = txSize;
        slave->status = LPI2C_STATUS_BUSY;
        /* Activate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT,
                              true);
        slave->txBusy = true;
        /* Enable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, true);
        while (slave->txBusy == true)
        {
            /* Wait for transmission to be completed */
        }
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveReceiveData
 * Description   : perform a non-blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveReceiveData(uint32_t   instance,
                                       uint8_t * rxBuff,
                                       uint32_t  rxSize)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

