arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
    if (!slave->slaveListening)
    {
        if (slave->rxBusy == true)
        {
            /* Slave is busy */
            return LPI2C_STATUS_BUSY;
        }
        slave->rxBuff = rxBuff;
        slave->rxSize = rxSize;
        slave->status = LPI2C_STATUS_BUSY;
        /* Activate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_RECEIVE_DATA_INT,
                              true);
        slave->rxBusy = true;
        /* Enable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, true);
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveReceiveDataBlocking
 * Description   : perform a blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveReceiveDataBlocking(uint32_t instance,
                                       uint8_t  * rxBuff,
                                       uint32_t   rxSize)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    if (!slave->slaveListening)
    {
        if (slave->rxBusy == true)
        {
            /* Slave is busy */
            return LPI2C_STATUS_BUSY;
        }
        slave->rxBuff = rxBuff;
        slave->rxSize = rxSize;
        slave->status = LPI2C_STATUS_BUSY;
        /* Activate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_RECEIVE_DATA_INT,
                              true);
        slave->rxBusy = true;
        /* Enable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, true);
        while (slave->rxBusy == true)
        {
            /* Wait for reception to be completed */
        }
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveGetReceiveStatus
 * Description   : return the current status of the I2C slave receive
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveGetReceiveStatus(uint32_t instance,
                                               uint32_t *bytesRemaining)
{
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    if (bytesRemaining)
    {
        *bytesRemaining = slave->rxSize;
    }

    return slave->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveGetTransmitStatus
 * Description   : return the current status of the I2C slave transmit
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveGetTransmitStatus(uint32_t instance,
                                                uint32_t *bytesRemaining)
{
    lpi2c_slave_state_t * slave;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    if (bytesRemaining)
    {
        *bytesRemaining = slave->txSize;
    }

    return slave->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveAbortTransferData
 * Description   : abort a non-blocking I2C Master transmission or reception
 *
 *END**************************************************************************/
lpi2c_status_t LPI2C_DRV_SlaveAbortTransferData(uint32_t instance)
{
    lpi2c_slave_state_t * slave;
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];
    baseAddr = g_lpi2cBase[instance];

    if (!slave->slaveListening)
    {
        /* Deactivate events */
        LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                        LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                        LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                        LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                        LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                        LPI2C_HAL_SLAVE_RECEIVE_DATA_INT |
                                        LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT,
                              false);
        slave->rxBusy = false;
        slave->txBusy = false;
        /* Disable LPI2C slave */
        LPI2C_HAL_SlaveSetEnable(baseAddr, false);
    }

    return LPI2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_SlaveIRQHandler
 * Description   : handle non-blocking slave operation when I2C interrupt occurs
 *
 *END**************************************************************************/
void LPI2C_DRV_SlaveIRQHandler(uint32_t instance)
{
    LPI2C_Type *baseAddr;
    lpi2c_slave_state_t * slave;
    uint16_t receivedAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    slave = (lpi2c_slave_state_t *)g_lpi2cStatePtr[instance];

    /* Check which event caused the interrupt */
    if (LPI2C_HAL_SlaveGetAddressValidEvent(baseAddr))
    {
        receivedAddr = LPI2C_HAL_SlaveGetReceivedAddr(baseAddr);
        if (receivedAddr & 1U)
        {
            /* Request from master to transmit data */
            if (slave->slaveCallback != NULL)
            {
                slave->slaveCallback(instance, LPI2C_SLAVE_EVENT_TX_REQ, slave->callbackParam);
            }
            slave->txUnderrunWarning = false;
        }
        else
        {
            /* Request from master to receive data */
            if (slave->slaveCallback != NULL)
            {
                slave->slaveCallback(instance, LPI2C_SLAVE_EVENT_RX_REQ, slave->callbackParam);
            }
        }
        slave->status = LPI2C_STATUS_BUSY;
    }
    if (LPI2C_HAL_SlaveGetTransmitDataEvent(baseAddr))
    {
        if (slave->txUnderrunWarning == true)
        {
            /* Another Tx event after underflow warning means the dummy char was sent */
            slave->status = LPI2C_STATUS_SLAVE_TX_UNDERRUN;
        }
        if (slave->txSize == 0U)
        {
            /* Out of data, call callback to allow user to provide a new buffer */
            if (slave->slaveCallback != NULL)
            {
                slave->slaveCallback(instance, LPI2C_SLAVE_EVENT_TX_EMPTY, slave->callbackParam);
            }
        }
        if (slave->txSize == 0U)
        {
            /* Still no data, record tx underflow event and send dummy char */
            /* Special case after the last tx byte: the device will ask for more data 
               but the dummy char will not be sent if NACK and then STOP condition are 
               received from master. So only record a "warning" for now. */
            slave->txUnderrunWarning = true;
            LPI2C_HAL_SlaveTransmitData(baseAddr, (uint8_t)0xFFU);
        }
        else
        {
            LPI2C_HAL_SlaveTransmitData(baseAddr, slave->txBuff[0U]);
            slave->txBuff++;
            slave->txSize--;
        }
    }
    if (LPI2C_HAL_SlaveGetReceiveDataEvent(baseAddr))
    {
        if (slave->rxSize == 0U)
        {
            /* No more room for data, call callback to allow user to provide a new buffer */
            if (slave->slaveCallback != NULL)
            {
                slave->slaveCallback(instance, LPI2C_SLAVE_EVENT_RX_FULL, slave->callbackParam);
            }
        }
        if (slave->rxSize == 0U)
        {
            /* Still no room for data, record rx overrun event and dummy read data */
            slave->status = LPI2C_STATUS_SLAVE_RX_OVERRUN;
            LPI2C_HAL_SlaveGetData(baseAddr);
        }
        else
        {
            slave->rxBuff[0U] = LPI2C_HAL_SlaveGetData(baseAddr);
            slave->rxBuff++;
            slave->rxSize--;
        }
    }
    if (LPI2C_HAL_SlaveGetSTOPDetectEvent(baseAddr) || 
        LPI2C_HAL_SlaveGetRepeatedStartEvent(baseAddr))
    {
        /* Either STOP or repeated START have the same meaning here: the current transfer is over */
        LPI2C_HAL_SlaveClearSTOPDetectEvent(baseAddr);
        LPI2C_HAL_SlaveClearRepeatedStartEvent(baseAddr);

