arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lpi2c/fsl_lpi2c_driver.c
        if (slave->status == LPI2C_STATUS_BUSY)
        {
            /* Report success if no error was recorded */
            slave->status = LPI2C_STATUS_SUCCESS;
        }
        if (!slave->slaveListening)
        {
            /* Deactivate events */
            LPI2C_HAL_SlaveSetInt(baseAddr, LPI2C_HAL_SLAVE_BIT_ERROR_INT |
                                            LPI2C_HAL_SLAVE_FIFO_ERROR_INT |
                                            LPI2C_HAL_SLAVE_STOP_DETECT_INT |
                                            LPI2C_HAL_SLAVE_REPEATED_START_INT |
                                            LPI2C_HAL_SLAVE_ADDRESS_VALID_INT |
                                            LPI2C_HAL_SLAVE_RECEIVE_DATA_INT |
                                            LPI2C_HAL_SLAVE_TRANSMIT_DATA_INT,
                                  false);
            slave->txBusy = false;
            slave->rxBusy = false;
            /* Disable LPI2C slave */
            LPI2C_HAL_SlaveSetEnable(baseAddr, false);
        }
    }
    if (LPI2C_HAL_SlaveGetBitErrorEvent(baseAddr))
    {
        LPI2C_HAL_SlaveClearBitErrorEvent(baseAddr);
        slave->status = LPI2C_STATUS_FAIL;
    }
    if (LPI2C_HAL_SlaveGetFIFOErrorEvent(baseAddr))
    {
        /* In Ultra-Fast mode clock stretching is disabled, so it is possible to get 
           this event if the slave can't keep up */
        LPI2C_HAL_SlaveClearFIFOErrorEvent(baseAddr);
        slave->status = LPI2C_STATUS_SLAVE_RX_OVERRUN;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPI2C_DRV_IRQHandler
 * Description   : handle non-blocking slave or master operation when I2C interrupt occurs
 *
 *END**************************************************************************/
void LPI2C_DRV_IRQHandler(uint32_t instance)
{
    LPI2C_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < LPI2C_INSTANCE_COUNT);
#endif

    baseAddr = g_lpi2cBase[instance];
    if (LPI2C_HAL_MasterGetEnable(baseAddr))
    {
        LPI2C_DRV_MasterIRQHandler(instance);
    }
    else if (LPI2C_HAL_SlaveGetEnable(baseAddr))
    {
        LPI2C_DRV_SlaveIRQHandler(instance);
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
